
schedule = {
    '120': {
        '1':
            {
            'top':
                 
                '1. Языки программирования лк 404-2 Шарафеддин М.А.\n'
                '2. Философия лк Г-3 Александрова О.С. /'
                '3. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '4. Иностранный язык пр 07-1 Замараева Г.Н. англ., нач.',

            'bottom':
        
                '1. Философия пр 411-2 Геранина Г.А.\n'
                '2. БЖ лк Г-3 Киндеев Е.А.\n'
                '3. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '4. Иностранный язык пр 07-1 Замараева Г.Н. англ., нач.'
            },

        '2': 
            {
            'top':
                 
                '1. Языки программирования лб 401-2 Шарафеддин М.А. /'
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n'
                '2. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n'
                '3. БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.\n'
                '4. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.'
                'Без пары',

            'bottom':
                 
                '1. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n'
                '2. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n'
                '3. БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.\n'
                '4. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                'Нет пары'
            },

        '3':
            {
            'top':  
                 
                '1. Электроника и схемотехника лк 404-2 Туляков В.С.\n'
                '2. Физика лк В-3 Галкин А.Ф.\n'
                '3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары\n'
                '4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары',

            'bottom':
                 
                '1. Электроника и схемотехника лк 404-2 Туляков В.С.\n'
                '2. Графические информационные технологии лк 404-2 Куликов К.В.\n'
                '3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары\n'
                '4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары'
                 
            },

        '4':
            {
            'top': 
                 
                '1. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '2. Математика лк Г-3 Крашенинникова О.В.\n'
                '3. Иностранный язык пр 110-2 Борисова А.Ю. англ. Иностранный язык пр 333-1 Койкова Т.И. англ',

            'bottom':
                 
                '1. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '2. Математика лк Г-3 Крашенинникова О.В.\n'
                '3. Иностранный язык пр 110-2 Борисова А.Ю. англ. Иностранный язык пр 333-1 Койкова Т.И. англ.'
                 
            },
        '5':
            {
            'top':
                 
                '1. Языки программирования пр 401-2 Шарафеддин М.А.\n'
                '2. Численные методы лк 404-2 Ланцов В.Н.\n'
                '3. Численные методы пр 411-2 Ланцов В.Н.\n'
                '4. Математика пр 411-2 Крашенинникова О.В.',
            'bottom':
                 
                '1. Математика пр 411-2 Крашенинникова О.В.\n'
                '2. Численные методы лк 404-2 Ланцов В.Н.\n'
                '3. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3 с 1 нед. по 8 нед.\n'
                '4. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3 с 1 нед. по 8 нед.'
                 
            },
        },


    '220': {
         '1':
            {
            'top': 
                 
                '1. Языки программирования лк 404-2 Шарафеддин М.А.\n'
                '2. Философия лк Г-3 Александрова О.С.\n'
                '3. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '4. Иностранный язык пр 07-1 Замараева Г.Н. англ., нач. Иностранный язык пр 410-1 Койкова Т.И. англ. Иностранный язык пр 430-1 Жукова Д.Д. англ.',

            'bottom':
                 
                '1. Нет пары\n'
                '2. БЖ лк Г-3 Киндеев Е.А.\n'
                '3. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '4. Иностранный язык пр 07-1 Замараева Г.Н. англ., нач. Иностранный язык пр 410-1 Койкова Т.И. англ. Иностранный язык пр 430-1 Жукова Д.Д. англ.'
            },

        '2': 
            {
            'top':
                 
                '1. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                'Нет пары\n'
                '2. БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед\n'
                '3. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед\n'
                '4. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед',

            'bottom':
                 
               '1. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                'Нет пары\n'
                '2. БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед\n'
                '3. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед\n'
                '4. Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед'
                 
            },

        '3':
            {
            'top':
                 
                '1. Электроника и схемотехника лк 404-2 Туляков В.С.\n'
                '2. Физика лк В-3 Галкин А.Ф.\n'
                '3. Философия пр 411-2 Геранина Г.А.',

            'bottom':
                 
                '1. Электроника и схемотехника лк 404-2 Туляков В.С.\n'
                '2. Графические информационные технологии лк 404-2 Куликов К.В.\n'
                '3. Нет пары'
                 
            },

        '4':
            {
            'top':
                 
                '1. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '2. Математика лк Г-3 Крашенинникова О.В.\n'
                '3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары\n'
                '4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары',

            'bottom':
                '1. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n'
                '2. Математика лк Г-3 Крашенинникова О.В.\n'
                '3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары\n'
                '4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары'
            },

        '5':
            {
            'top':
                 
                '1. Математика пр 411-2 Крашенинникова О.В.\n'
                '2. Численные методы лк 404-2 Ланцов В.Н.\n'
                '3. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3\n'
                '4. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3',

            'bottom':
                 
                '1. Языки программирования пр 401-2 Шарафеддин М.А.\n'
                '2. Численные методы лк 404-2 Ланцов В.Н.\n'
                '3. Численные методы пр 411-2 Ланцов В.Н.\n'
                '4. Математика пр 411-2 Крашенинникова О.В.'
            }
    }
}