
schedule = {
    '120': {
        '1':
            {
            'top':
                 
                '<b>1.</b> <b>Языки программирования лк 404-2 Шарафеддин М.А.\n\n</b>'
                '<b>2.</b> <b>Философия лк Г-3 Александрова О.С. \n\n</b>'
                '<b>3.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>4.</b> <b>Иностранный язык пр 07-1 Замараева Г.Н. англ., нач.</b>',

            'bottom':
        
                '<b>1. Философия пр 411-2 Геранина Г.А.</b>\n\n'
                '<b>2.</b> <b>БЖ лк Г-3 Киндеев Е.А.\n\n</b>'
                '<b>3.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>4.</b> <b>Иностранный язык пр 07-1 Замараева Г.Н. англ., нач.</b>'
            },

        '2': 
            {
            'top':
                 
                '<b>1.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b>'
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>.\n\n'
                '<b>2.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>.\n\n<'
                '<b>3.</b> <b>БЖ лб 305а-2 Баландина Е.А. / </b>'
                '<b>Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.</b>\n\n'
                '<b>4. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.</b>'
                '<b>Нет пары</b>',

            'bottom':
                 
                '<b>1.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>.\n\n'
                '<b>2.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>.\n\n'
                '<b>3.</b> <b>БЖ лб 305а-2 Баландина Е.А. / </b>'
                '<b>Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.\n\n</b>'
                '<b>4. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / </b>'
                '<b>Нет пары</b>'
            },

        '3':
            {
            'top':  
                 
                '<b>1. Электроника и схемотехника лк 404-2 Туляков В.С.</b>\n\n'
                '<b>2. Физика лк В-3 Галкин А.Ф.</b>\n\n'
                '<b>3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b><b>Нет пары</b>\n\n'
                '<b>4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b><b>Нет пары</b>',

            'bottom':
                 
                '<b>1. Электроника и схемотехника лк 404-2 Туляков В.С.</b>\n\n'
                '<b>2. Графические информационные технологии лк 404-2 Куликов К.В.</b>\n\n'
                '<b>3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b><b>Нет пары</b>\n\n'
                '<b>4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b><b>Нет пары</b>'
                 
            },

        '4':
            {
            'top': 
                 
                '<b>1.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>2. Математика лк Г-3 Крашенинникова О.В.</b>\n\n'
                '<b>3. Иностранный язык пр 110-2 Борисова А.Ю. англ. Иностранный язык пр 333-1 Койкова Т.И. англ</b>',

            'bottom':
                 
                '<b>1.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>2. Математика лк Г-3 Крашенинникова О.В.</b>\n\n'
                '<b>3. Иностранный язык пр 110-2 Борисова А.Ю. англ. Иностранный язык пр 333-1 Койкова Т.И. англ.</b>'
                 
            },
        '5':
            {
            'top':
                 
                '<b>1. Языки программирования пр 401-2 Шарафеддин М.А.</b>\n\n'
                '<b>2. Численные методы лк 404-2 Ланцов В.Н.</b>\n\n'
                '<b>3. Численные методы пр 411-2 Ланцов В.Н.</b>\n\n'
                '<b>4. Математика пр 411-2 Крашенинникова О.В.</b>',
                
            'bottom':
                 
                '<b>1. Математика пр 411-2 Крашенинникова О.В.</b>\n\n'
                '<b>2. Численные методы лк 404-2 Ланцов В.Н.</b>\n\n'
                '<b>3. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3 с 1 нед. по 8 нед.</b>\n\n'
                '<b>4. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3 с 1 нед. по 8 нед.</b>'
                 
            },
        },


    '220': {
         '1':
            {
            'top': 
                 
                '<b>1.</b> <b>Языки программирования лк 404-2 Преподаватель: Шарафеддин М.А.</b>\n\n'
                '<b>2. Философия лк Г-3 Александрова О.С.</b>.\n\n'
                '<b>3.</b>. <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>4.</b> <b>Иностранный язык пр 07-1 Замараева Г.Н. англ., нач. Иностранный язык пр 410-1 Койкова Т.И. англ. Иностранный язык пр 430-1 Жукова Д.Д. англ.</b>',

            'bottom':
                 
                '<b>1.</b> <b>Нет пары</b>\n\n'
                '<b>2.</b> <b>БЖ лк Г-3 Киндеев Е.А.\n\n</b>'
                '<b>3.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>4.</b> <b>Иностранный язык пр 07-1 Замараева Г.Н. англ., нач. Иностранный язык пр 410-1 Койкова Т.И. англ. Иностранный язык пр 430-1 Жукова Д.Д. англ.</b>'
            },

        '2': 
            {
            'top':
                 
                '<b>1.</b> Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                '<b>Нет пары</b>\n\n'
                '<b><b>2.</b></b> <b>БЖ лб 305а-2 Баландина Е.А. / </b>'
                '<b>Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед\n\n</b>'
                '<b>3.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b><b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>\n\n</b>'
                '<b>4.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>',

            'bottom':
                 
               '<b>1. Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / </b>'
                '<b>Нет пары</b>\n\n'
                '<b>2.</b> <b>БЖ лб 305а-2 Баландина Е.А. / </b>'
                '<b>Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед\n\n</b>'
                '<b>3.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>\n\n'
                '<b>4.</b> <b>Языки программирования лб 401-2 Шарафеддин М.А. / </b> '
                '<b>Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед</b>'
                 
            },

        '3':
            {
            'top':
                 
                '<b>1. Электроника и схемотехника лк 404-2 Туляков В.С.</b>\n\n'
                '<b>2. Физика лк В-3 Галкин А.Ф.</b>\n\n'
                '<b>3. Философия пр 411-2 Геранина Г.А.</b>',

            'bottom':
                 
                '<b>1. Электроника и схемотехника лк 404-2 Туляков В.С.</b>\n\n'
                '<b>2. Графические информационные технологии лк 404-2 Куликов К.В.</b>\n\n'
                '<b>3.</b> <b>Нет пары</b>'
                 
            },

        '4':
            {
            'top':
                 
                '<b>1.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>2. Математика лк Г-3 Крашенинникова О.В.</b>\n\n'
                '<b>3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b>'
                '<b>Нет пары</b>\n\n'
                '<b>4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b>'
                '<b>Нет пары</b>',

            'bottom':
                '<b>1.</b> <b>Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n</b>'
                '<b>2. Математика лк Г-3 Крашенинникова О.В.</b>\n\n'
                '<b>3. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b>'
                '<b>Нет пары</b>\n\n'
                '<b>4. Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / </b>'
                '<b>Нет пары</b>'
            },

        '5':
            {
            'top':
                 
                '<b>1. Математика пр 411-2 Крашенинникова О.В.</b>\n\n'
                '<b>2. Численные методы лк 404-2 Ланцов В.Н.</b>\n\n'
                '<b>3. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3</b>\n\n'
                '<b>4. Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3</b>',

            'bottom':
                 
                '<b>1. Языки программирования пр 401-2 Шарафеддин М.А.</b>\n\n'
                '<b>2. Численные методы лк 404-2 Ланцов В.Н.</b>\n\n'
                '<b>3. Численные методы пр 411-2 Ланцов В.Н.</b>\n\n'
                '<b>4. Математика пр 411-2 Крашенинникова О.В.</b>'
            }
    }
}