
schedule = {
    '120': {
        '1':
            {
            'top':
                 
                '<b>1.</b> Языки программирования лк 404-2 Шарафеддин М.А.\n\n'
                '<b>2.</b> Философия лк Г-3 Александрова О.С. \n\n'
                '<b>3.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>4.</b> Иностранный язык пр 07-1 Замараева Г.Н. англ., нач.',

            'bottom':
        
                '<b>1.</b> Философия пр 411-2 Геранина Г.А.\n\n'
                '<b>2.</b> БЖ лк Г-3 Киндеев Е.А.\n\n'
                '<b>3.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>4.</b> Иностранный язык пр 07-1 Замараева Г.Н. англ., нач.'
            },

        '2': 
            {
            'top':
                 
                '<b>1.</b> Языки программирования лб 401-2 Шарафеддин М.А. /'
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n\n'
                '<b>2.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n\n'
                '<b>3.</b> БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.\n\n'
                '<b>4.</b> Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.'
                'Без пары',

            'bottom':
                 
                '<b>1.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n\n'
                '<b>2.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед.\n\n'
                '<b>3.</b> БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед.\n\n'
                '<b>4.</b> Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                'Нет пары'
            },

        '3':
            {
            'top':  
                 
                '<b>1.</b> Электроника и схемотехника лк 404-2 Туляков В.С.\n\n'
                '<b>2.</b> Физика лк В-3 Галкин А.Ф.\n\n'
                '<b>3.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары\n\n'
                '<b>4.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары',

            'bottom':
                 
                '<b>1.</b> Электроника и схемотехника лк 404-2 Туляков В.С.\n\n'
                '<b>2.</b> Графические информационные технологии лк 404-2 Куликов К.В.\n\n'
                '<b>3.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары\n\n'
                '<b>4.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / Нет пары'
                 
            },

        '4':
            {
            'top': 
                 
                '<b>1.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>2.</b> Математика лк Г-3 Крашенинникова О.В.\n\n'
                '<b>3.</b> Иностранный язык пр 110-2 Борисова А.Ю. англ. Иностранный язык пр 333-1 Койкова Т.И. англ',

            'bottom':
                 
                '<b>1.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>2.</b> Математика лк Г-3 Крашенинникова О.В.\n\n'
                '<b>3.</b> Иностранный язык пр 110-2 Борисова А.Ю. англ. Иностранный язык пр 333-1 Койкова Т.И. англ.'
                 
            },
        '5':
            {
            'top':
                 
                '<b>1.</b> Языки программирования пр 401-2 Шарафеддин М.А.\n\n'
                '<b>2.</b> Численные методы лк 404-2 Ланцов В.Н.\n\n'
                '<b>3.</b> Численные методы пр 411-2 Ланцов В.Н.\n\n'
                '<b>4.</b> Математика пр 411-2 Крашенинникова О.В.',
                
            'bottom':
                 
                '<b>1.</b> Математика пр 411-2 Крашенинникова О.В.\n\n'
                '<b>2.</b> Численные методы лк 404-2 Ланцов В.Н.\n\n'
                '<b>3.</b> Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3 с 1 нед. по 8 нед.\n\n'
                '<b>4.</b> Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3 с 1 нед. по 8 нед.'
                 
            },
        },


    '220': {
         '1':
            {
            'top': 
                 
                '<b>1.</b> Языки программирования лк\n'
                '     Кабинет: 404-2\n'
                '     Преподаватель: Шарафеддин М.А.\n\n'
                '<b>2.</b>. Философия лк Г-3 Александрова О.С.\n\n'
                '<b>3.</b>. Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>4.</b> Иностранный язык пр 07-1 Замараева Г.Н. англ., нач. Иностранный язык пр 410-1 Койкова Т.И. англ. Иностранный язык пр 430-1 Жукова Д.Д. англ.',

            'bottom':
                 
                '<b>1.</b> Нет пары\n\n'
                '<b>2.</b> БЖ лк Г-3 Киндеев Е.А.\n\n'
                '<b>3.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>4.</b> Иностранный язык пр 07-1 Замараева Г.Н. англ., нач. Иностранный язык пр 410-1 Койкова Т.И. англ. Иностранный язык пр 430-1 Жукова Д.Д. англ.'
            },

        '2': 
            {
            'top':
                 
                '<b>1.</b> Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                'Нет пары\n\n'
                '<b><b>2.</b></b> БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед\n\n'
                '<b>3.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед\n\n'
                '<b>4.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед',

            'bottom':
                 
               '<b>1.</b> Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед. / '
                'Нет пары\n\n'
                '<b>2.</b> БЖ лб 305а-2 Баландина Е.А. / '
                'Графические информационные технологии лб 412-2 Куликов К.В. с 1 нед. по 10 нед\n\n'
                '<b>3.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед\n\n'
                '<b>4.</b> Языки программирования лб 401-2 Шарафеддин М.А. / '
                'Электроника и схемотехника лб 416-2 Туляков В.С. с 10 нед. по 18 нед'
                 
            },

        '3':
            {
            'top':
                 
                '<b>1.</b> Электроника и схемотехника лк 404-2 Туляков В.С.\n\n'
                '<b>2.</b> Физика лк В-3 Галкин А.Ф.\n\n'
                '<b>3.</b> Философия пр 411-2 Геранина Г.А.',

            'bottom':
                 
                '<b>1.</b> Электроника и схемотехника лк 404-2 Туляков В.С.\n\n'
                '<b>2.</b> Графические информационные технологии лк 404-2 Куликов К.В.\n\n'
                '<b>3.</b> Нет пары'
                 
            },

        '4':
            {
            'top':
                 
                '<b>1.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>2.</b> Математика лк Г-3 Крашенинникова О.В.\n\n'
                '<b>3.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары\n\n'
                '<b>4.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары',

            'bottom':
                '<b>1.</b> Элективные дисциплины по физической культуре и спорту пр Тарасевич О.Д.\n\n'
                '<b>2.</b> Математика лк Г-3 Крашенинникова О.В.\n\n'
                '<b>3.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары\n\n'
                '<b>4.</b> Численные методы лб 401-2 Крутин Д.В. с 10 нед. по 18 нед. / '
                'Нет пары'
            },

        '5':
            {
            'top':
                 
                '<b>1.</b> Математика пр 411-2 Крашенинникова О.В.\n\n'
                '<b>2.</b> Численные методы лк 404-2 Ланцов В.Н.\n\n'
                '<b>3.</b> Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3\n\n'
                '<b>4.</b> Физика лб 422-3 Галкин А.Ф. + ауд. 431-3 с 1 нед. по 8 нед.Физика лб 422-3 Прокошева Н.С. + ауд. 431-3',

            'bottom':
                 
                '<b>1.</b> Языки программирования пр 401-2 Шарафеддин М.А.\n\n'
                '<b>2.</b> Численные методы лк 404-2 Ланцов В.Н.\n\n'
                '<b>3.</b> Численные методы пр 411-2 Ланцов В.Н.\n\n'
                '<b>4.</b> Математика пр 411-2 Крашенинникова О.В.'
            }
    }
}